Repository: buddyactivist/buddyactivist-passwordless
Catalog: languages/buddyactivist-passwordless-*.po
Languages: it_it

source: Complete your registration
it_it: Completa la tua registrazione

source: Click the link below to complete your registration: %s
it_it: Clicca il link qui sotto per completare la tua registrazione: %s

source: Login to your account
it_it: Accedi al tuo account

source: Click the link below to log in to the site: %s
it_it: Clicca il link qui sotto per accedere al sito: %s

source: Please enter a valid email address.
it_it: Inserisci un indirizzo email valido.

source: We have sent you a magic link to complete your registration.
it_it: Ti abbiamo inviato un link magico per completare la registrazione.

source: Security check failed. Please try again.
it_it: Controllo di sicurezza non riuscito. Riprova.

source: You must be logged in to complete your registration.
it_it: Devi essere connesso per completare la registrazione.

source: There was an error uploading your avatar. Please try again.
it_it: Si è verificato un errore durante il caricamento dell’avatar. Riprova.

source: Your avatar is too large. The maximum size is 2MB.
it_it: Il tuo avatar è troppo grande. La dimensione massima è 2MB.

source: Invalid avatar format. Please upload a JPG, PNG, GIF, or WebP image.
it_it: Formato avatar non valido. Carica un’immagine JPG, PNG, GIF o WebP.

source: Your avatar is too small. Minimum size is 300x300 pixels.
it_it: Il tuo avatar è troppo piccolo. La dimensione minima è 300x300 pixel.

source: There was an error saving your avatar. Please try again.
it_it: Si è verificato un errore durante il salvataggio dell’avatar. Riprova.

source: There was an error processing your avatar. Please try again.
it_it: Si è verificato un errore durante l’elaborazione dell’avatar. Riprova.

source: Enter your email address to register on the site.
it_it: Inserisci il tuo indirizzo email per registrarti al sito.

source: Send magic link
it_it: Invia link magico

source: Enter your email address to log in.
it_it: Inserisci il tuo indirizzo email per accedere.

source: Complete your profile to finish your registration.
it_it: Completa il tuo profilo per terminare la registrazione.

source: Profile fields are not available at the moment.
it_it: I campi del profilo non sono disponibili al momento.

source: Upload your avatar (optional)
it_it: Carica il tuo avatar (opzionale)

source: Complete registration
it_it: Completa la registrazione

source: To complete your registration, follow the instructions below.
it_it: Per completare la tua registrazione, segui le istruzioni qui sotto.

source: Your registration is almost complete. If required, complete the payment below.
it_it: La tua registrazione è quasi completa. Se richiesto, completa il pagamento qui sotto.

source: You have 60 minutes to complete the payment.
it_it: Hai 60 minuti per completare il pagamento.

source: Your time to complete the payment has expired.
it_it: Il tempo per completare il pagamento è scaduto.

source: To complete your registration, press the button below.
it_it: Per completare la tua registrazione, premi il pulsante qui sotto.

source: Finish registration
it_it: Termina la registrazione
